cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.7" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32H7xx_DFP</name>
  <description>STMicroelectronics STM32H7 Series Device Support and Examples</description>
  <url>https://www.keil.com/pack/</url>

  <releases>
    <release version="3.1.1" date="2023-07-04">
      Board Support:
      - Updated emWin examples
      -- emWin LCD configuration for STM32H743I_EVAL
      CMSIS-Driver:
      - I2C: Updated I2C_GetPeriClock function implementation
    </release> 
    <release version="3.1.0" date="2023-03-22">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version to V1.11.0
      Device Support:
      - Updated documentation
      - Updated SVD files
      Pack Description:
      - Removed HAL dependency for component ::Device:Startup
      - Removed unnecessary Documentation components (STM32H743I-EVAL and STM32H7B3I-EVAL)
      Board Support:
      - Updated STM32H743I_EVAL and STM32H7B3I_EVAL emWin LCD configuration
      Examples:
      - Updated linker script files (relating to LTO)
      - Updated MPU region for SDRAM and SDRAM configuration
      - Corrected EMAC DMA descriptors positioning for toolchains other than GNU
      - Added command-line option for placement of unassigned sections (--any_placement=first_fit).
      - Updated RTX_Config files
      CMSIS-Driver:
      - Updated documentation
      - Updated necessary variables to volatile to avoid LTO problems
      - EMAC:
      -- Updated receive functions for HAL zero-copy concept
      -- Corrected multicast address filtering
      - I2C:
      -- Corrected MasterTransmit and MasterReceive functions when not generating STOP condition (when xfer_pending is "true")
      -- Corrected Bus Clear functionality
      -- Corrected check if I2C peripheral is enabled in the CubeMx and improved user experience if it is not enabled
      -- Added support for DMA and Data Cache handling
      - MCI:
      -- Improved PowerControl and Control functions
      - SPI:
      -- Corrected GetDataCount implementation
      -- Corrected GetStatus function handling of Mode Fault
      -- Improved robustness of Initialize, Uninitialize, PowerControl and Control functions
      -- Updated DMA and Data Cache handling (improved code readability and maintainability)
      - USART:
      -- Corrected Flow Control capabilities
      -- Corrected GetStatus function and status flags handling
      -- Corrected GetTxCount and GetRxCount implementation
      -- Updated DMA and Data Cache handling (improved code readability and maintainability)
      - USBH:
      -- Corrected check if Host mode is enabled
    </release>
    <release version="3.0.0" date="2022-02-28">
      STM32CubeMX integration:
      - New workflow concept (incompatible with earlier STM32H7xx_DFPs).
      - Automatic migration of projects created with earlier STM32H7xx_DFPs.
      - Added STM32CubeMX integration for Dual-core devices.
      CMSIS-Driver:
      - I2C: Added I2C interface for I2C5 (Driver_I2C5).
      - USART:
      -- LPUART1 interface accessed by Driver_USART21 (previously by Driver_USART9).
      -- Added UART interface for USART9 (Driver_USART9).
      -- Added UART interface for USART10 (Driver_USART10).
      - MCI:
      -- Updated retrieval of SDMMC kernel clock frequency in PowerControl function.
      Examples:
      - Migrated to new workflow concept.
      - Added MPU configuration.
      - Added linker scatter files.
    </release>
    <release version="2.8.0" date="2021-09-13">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.9.0.
      STM32CubeMX integration:
      - Added support for BDMA, I2S, LIBJPEG, RNG, SPDIFRX, VREFBUF configurations (FrameworkCubeMX_gpdsc.ftl).
      - Suppressed generation of the condition for the Debug Component (FrameworkCubeMX_gpdsc.ftl).
      - Synchronized versions of generated component ::Device:STM32Cube Framework:STM32CubeMX (in gpdsc) and its bootstrap (in pdsc).
      Package Description (pdsc):
      - Updated schemaVersion (1.7.2).
      - Corrected device in board description attribute 'mountedDevice'.
      - Corrected RAM settings for STM32H72x, STM32H73x devices.
      - Added debugProbe to board description.
      - Added global define USE_HAL_DRIVER to the component ::Device:STM32Cube HAL:Common.
      - Added global define USE_FULL_LL_DRIVER to the component ::Device:STM32Cube LL:Common.
      Devices Support:
      - Added SDF files (STM32H743.sdf, STM32H747.sdf).
      Flash Programming Algorithms:
      - Updated Flash Loader source code (Added CMSIS-CORE component).
      CMSIS-Driver:
      - Updated disclaimers.
      - ETH: Removed Data Cache maintenance. DMA descriptors and frame buffers must be positioned in Non-cacheable memory.
      - I2C:
      -- Disabled DMA transfers.
      -- Corrected pins configuration.
      -- Synchronized to HAL V1.10.0.
      - MCI:
      -- Replaced empty delay loops with _NOP().
      -- Improved DCache maintenance.
      - SPI: Improved DCache maintenance.
      - UART:
      -- Added UART interface for LPUART1 (Driver_USART9).
      -- Improved DCache maintenance.
      - USBH:
      -- Fixed port resume occasionally getting stuck in resume signaling.
      -- Added compile time configuration for reducing Bulk IN NAK rate.
      - USBD:
      -- Added support for VBUS sensing.
      -- Corrected USBD_GetFrameNumber function.
      - OTG: Removed include of stm32h7xx_hal_pcd.h header.
      Examples:
      - Migrated CubeMX projects to V6.3.0.
      - Overridden default HAL_InitTick function.
      - Added scatter file to Network examples.
      - Updated USB examples for STM32H743I_EVAL board.
      - Changed Assembler option to armclang(Auto Select).
      - Updated config files to CMSIS 5.8.0.
    </release>
    <release version="2.7.0" date="2020-10-30">
      Devices Support:
      - Added device description for STM32H735VGHx, STM32H725VGHx and STM32H725VEHx.
      - Updated a subset of SVD files (STM32H723, STM32H73x, STM32H7A3x, STM32H7B3x).
      - Updated Reference Manual for STM32H7A3/B3 and STM32H7B0.
    </release>
    <release version="2.6.0" date="2020-09-11">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.8.0:
      - Added device support for STM32H72x/H73x with 1MB ad 512 kB flash size.
      - Added device support for STM32H730xxQ with 128KB flash size.
      - Added support to the OSPI external Loader for the STM32H735G Disco board with ITCM RAM at 0x24000000.
      - Updated external flash programming algorithms and added their projects (source code) for:
        STM32H747I-EVAL_QSPI, STM32H747I-Disco_QSPI, STM32H7B3I-EVAL_OSPI, STM32H7B0I-EVAL_OSPI, STM32H7B0I-Disco_OSPI, STM32H7B3I-Disco_OSPI, STM32H735G-Disco_OSPI
      - Updated SVD files.
      - Updated Documentation.
      CMSIS-Driver:
      - ETH: Added data cache enable bit check.
      - MCI:
      -- Added handling for separate SD and MMC HAL layers.
      -- Added busy signal handling after CMDREND interrupt.
      -- Added data cache enable bit check.
      Examples:
      - Migrated CubeMX projects to V6.0.0
      - Updated all USB Host/Device examples with user templates from MDK-Middleware v7.11.1
      - Updated emWin driver for STM32H7B3I_EVAL board.
    </release>
    <release version="2.5.0" date="2020-03-23">
      Board Support:
      - Added STM32H7B3I_EVAL board support.
      -- Blinky example
      Flash Programming:
      - Updated the internal Flash programming algorithm for STM32H7xxxG devices with 1MB flash size.
      - Updated the external FMC-NOR programming algorithm for both STM32H743I Eval Rev B01 (2015) and B03 (2018).
      - Added support for the external QSPI programming algorithm for the STM32H747I Disco board.
      - Added support for the external MMC programming algorithm for the STM32H750B-Disco board.
    </release>
    <release version="2.4.0" date="2020-01-29">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.6.0 (STM32CubeMX V5.5.0).
      This pack adds device support for:
      - Value line: STM32H7B0xx.
      - Product lines: STM32H7A3xx/HB3xx.
      Updated examples to use Arm Compiler 6 and
      Added additional Flash Algorithms.
      Updated SVD files.
    </release>
    <release version="2.3.1" date="2019-09-16">
      Updated GPDSC freemarker template:
      - Added support for IWDG, WWDG peripherals.
      - Added support for Timebase Source set to TIMx.
      CMSIS-Driver:
      - ETH: Corrected GetRxFrameSize and ReadFrame functions to fix long latencies.
      Updated board examples:
      - Terminating app_main thread with osThreadExit() to avoid endless loop.
      - Updated graphics examples for use with Segger emWin version 5.50.
    </release>
    <release version="2.3.0" date="2019-06-14">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.4.0.
      Requires STM32CubeMX version 5.2.1.
      STM32CubeMX Integration:
      - Only supported for single core devices.
      - Updated MX_Device_h.ftl:
         -- Added parsing of USART virtual mode.
         -- Added handling for bracket symbols '(' and ')' in macro generation.
      Updated Board Examples for STM32H743I_EVAL:
      - Updated to MDK-Middleware V7.8.0.
      - Updated to using CMSIS-RTOS2 RTX(Debug/Release).
      - Updated to enabling the Event Recorder in debug targets.
      CMSIS-Driver:
      - CAN: Corrected CAN SRAM read/write to 4 byte accesses.
      - ETH: Updated __MEMORY_AT macro supporting AC6.
      - FDCAN: Updated __MEMORY_AT macro  supporting AC6.
      - MCI: Updated to HAL drivers version 1.5.0.
      - USART: Updated Get Count functionality.
      - USB Host: Enable VDD33USB voltage level detector if internal FS transceiver is used.
      - USB Device
      -- Updated to HAL drivers version 1.5.0.
      -- Updated USBD_EndpointConfigure function to check that maximum packet size requested fits into configured FIFO (compile time configured).
      - SPI
      -- Corrected DCache Handling
      -- Removed __HAL_SPI_ENABLE from SPI_Control function
    </release>
    <release version="2.2.0" date="2018-09-04">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.3.0.
      - Updated HAL to version V1.3.0.
      Added device support for subfamily STM32H750.
      CMSIS Driver:
      - USB Device: Corrected transmitted count for non-control IN endpoints
    </release>
    <release version="2.1.0" date="2018-05-09">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.21.0.
      Reworked debug description and debug config files.
      Updated device documentation.
      CMSIS-Driver:
      - CAN:
      -- Changed FDCAN_ECR_TREC_.. to FDCAN_ECR_REC_.. to align with updated device header.
      -- Corrected SetBitrate function.
      - SPI: Corrected Slave select handling.
      - USART: Corrected UARTx/USARTx related typing mistakes.
      - I2C: master clock frequency generation corrected.
      Board Support:
      - STM32H743I_EVAL:
      -- Updated LCDConf.c for STM32H743I_EVAL.
      Board Examples:
      - Validated using STM32CubeMX version 4.25.0 and STM32Cube_FW_H7 version 1.2.0.
      - Updated Abstract.txt in examples reflecting Debug/Release targets.
      - Changed Compiler optimization level to "level 1" for Debug target in all examples.
      - Updated emWin examples to emWin V5.46e.
      - Added Event Recorder to the USB Device and Host examples.
      - Added SNMP_Agent Example.
      - Updated SMTP_Client example.
    </release>
    <release version="2.0.0" date="2017-10-02">
      This DFP requires STM32CubeMX V4.22.1 and STM32Cube_FW_H7 V1.1.0 or higher to be installed.
      New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' for configuration of pins and clocks.
      Updated documentation for STM32Cube Framework usage.
      Added CMSIS-Driver:
      - CAN
      - ETH
      - I2C
      - MCI
      - SPI
      - UART/USART
      - USB Host / Device (no RTOS dependency)
      Added example projects for STM32H743I EVAL Board:
      - all projects have two targets 'debug' and 'release' and require CMSIS-RTOS2
      - Blinky
      - CAN
      - emWin
      - FileSystem
      - Network
      - USB
    </release>
    <release version="1.0.1" date="2017-08-03">
      fixed location specified in debugvars configfile attribute
    </release>
    <release version="1.0.0" date="2017-06-01">
      Initial release of STM32H7 Device Family Pack.
      Based on STM32Cube_FW_H7 Firmware Package version V1.0.0 (2017-04-30)
      Board Support for STM32H743I-EVAL Board:
      - CMSIS-RTOS2 Blinky
      - Fractal Demo
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32H7</keyword>
    <keyword>STM32H7xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32H7 Series" Dvendor="STMicroelectronics:13">
      <!--book name="Documentation/?.pdf" title="STM32H7xx HAL Drivers"/-->

      <algorithm name="CMSIS/Flash/STM32H7B3I_EVAL_FMC-NOR.FLM"        start="0x60000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000" default="0" />
      <algorithm name="CMSIS/Flash/MT25TL01G_STM32H747I-DISCO.FLM"     start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />
      <algorithm name="CMSIS/Flash/MTFC4GACAJCN_STM32H750B-DISCO.FLM"  start="0xA0000000" size="0x20000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />
      <algorithm name="CMSIS/Flash/STM32H7xx_MT25TL01G.FLM"            start="0x90000000" size="0x04000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />
      <algorithm name="CMSIS/Flash/MT25TL01G_STM32H750B-DISCO.FLM"     start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />
      <algorithm name="CMSIS/Flash/MT25TL01G_STM32H745I-DISCO.FLM"     start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />
      <algorithm name="CMSIS/Flash/STM32H743I-eval_FMC.FLM"            start="0x60000000" size="0x01000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />
      <algorithm name="CMSIS/Flash/MX25LM51245G_STM32H7B3I-EVAL.FLM"   start="0x90000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000" default="0" />
      <algorithm name="CMSIS/Flash/MX25LM51245G_STM32H7B3I-Disco.FLM"  start="0x90000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000" default="0" />
      <algorithm name="CMSIS/Flash/MX25LM51245G_STM32H7B0-EVAL.FLM"    start="0x90000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000" default="0" />
      <algorithm name="CMSIS/Flash/MX25LM51245G_STM32H7B0-Disco.FLM"   start="0x90000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xA0000" default="0" />
      <algorithm name="CMSIS/Flash/MX25LM51245G_STM32H735-Disco.FLM"   start="0x90000000" size="0x04000000" RAMstart="0x24000000" RAMsize="0xFFF4"  default="0" />
      <algorithm name="CMSIS/Flash/MT25TL01G_STM32H747I-EVAL.FLM"      start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />
      <!-- obsolete algorithms -->
      <algorithm name="CMSIS/Flash/STM32H7xx_MT25TL01G_DUAL.FLM"       start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0xFFF4"  default="0" />

      <description>
The STM32H7 series now includes dual-core microcontrollers with Arm Cortex-M7 and Cortex-M4 cores able to run up to 480 MHz and 240 MHz respectively.
Our single-core Cortex-M7 STM32H7 series also benefits from this frequency increase and can now run up to 480 MHz as well.
Dual-core STM32H7 microcontrollers are available with an embedded SMPS for improved dynamic power efficiency.

Extended temperature range support up to 125 C (*) (ambient) will be available for certain devices for use in harsh environments including industrial applications.

STM32H7 devices embedding a crypto/hash processor support security services such as Secure Firmware Install and Secure Boot - Secure Firmware Upgrade allowing the installation of new application code in a secured manner.

