cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
        <sequences>
          <sequence name="DebugDeviceUnlock">
            <block>
              __var value = 0;

              Sequence("CheckID");

              __ap   = 2;                                         // Switch to System Debug Access Port

              value  = Read32(0xE00E1004);                        // Read DBGMCU_CR
              value |= 0x00670000;                                // set preset values (enable all debug clocks by default)
                                                                  // DBGMCU_CR[18] CKDBGD3EN, [17] CKDBGD2EN, [16] CKDBGD1EN
                                                                  // DBGMCU_CR[22] D3DBGCKEN, [21] D1DBGCKEN
            </block>

            <control if="__traceout"> <!-- Enable Trace Clock and hence access to global trace components now -->
              <block>
                value |= 0x00100000;                              // DBGMCU_CR[20] TRACECLKEN
              </block>
            </control>

            <block>
              Write32(0xE00E1004, value);                         // Update DBGMCU_CR
            </block>

            <block info="DbgMCU registers">
              Write32(0xE00E1004 , DbgMCU_CR        | value);     // DBGMCU_CR:       Configure MCU Debug
              Write32(0xE00E1034 , DbgMCU_APB3_Fz1         );     // DBGMCU_APB3FZ1:  Configure CPU1 APB3 peripheral freeze behavior
              Write32(0xE00E1038 , DbgMCU_APB3_Fz2         );     // DBGMCU_APB3FZ2:  Configure CPU2 APB3 peripheral freeze register
              Write32(0xE00E103C , DbgMCU_APB1L_Fz1        );     // DBGMCU_APB1LFZ1: Configure CPU1 APB1L peripheral freeze behavior
              Write32(0xE00E1040 , DbgMCU_APB1L_Fz2        );     // DBGMCU_APB1LFZ2: Configure CPU2 APB1L peripheral freeze register
              Write32(0xE00E104C , DbgMCU_APB2_Fz1         );     // DBGMCU_APB2FZ1:  Configure CPU1 APB2 peripheral freeze behavior
              Write32(0xE00E1050 , DbgMCU_APB2_Fz2         );     // DBGMCU_APB2FZ2:  Configure CPU2 APB2 peripheral freeze register
              Write32(0xE00E1054 , DbgMCU_APB4_Fz1         );     // DBGMCU_APB4FZ1:  Configure CPU1 APB4 peripheral freeze behavior
              Write32(0xE00E1058 , DbgMCU_APB4_Fz2         );     // DBGMCU_APB4FZ2:  Configure CPU2 APB4 peripheral freeze register
            </block>
          </sequence>
        </sequences>

        <algorithm Pname="CM7" name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000" RAMstart="0x20000000" RAMsize="0x8000" default="1" />
        <algorithm Pname="CM4" name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000" RAMstart="0x10000000" RAMsize="0x8000" default="1" />

        <memory Pname="CM7" name="DTCMRAM"  access="rw"             start="0x20000000" size="0x00020000" default="1" init="0"/>
        <memory Pname="CM7" name="RAM_D1"   access="rw"             start="0x24000000" size="0x00080000" default="1" init="0"/>
        <memory Pname="CM7" name="RAM_D3"   access="rw"             start="0x38000000" size="0x00010000" default="1" init="0"/>
     <!--memory Pname="CM7" name="ITCMRAM"  access="rw"             start="0x00000000" size="0x00010000" default="1" init="0"/-->

        <memory Pname="CM4" name="RAM_D2"   access="rw"             start="0x10000000" size="0x00048000" default="1" init="0"/>

        <!-- *************************  Device 'STM32H745BGTx'  ***************************** -->
        <device Dname="STM32H745BGTx">
          <compile Pname="CM7" define="STM32H745xG"/>
          <compile Pname="CM4" define="STM32H745xG"/>

          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="QFP" n="208"/>
        </device>

        <!-- *************************  Device 'STM32H745BITx'  ***************************** -->
        <device Dname="STM32H745BITx">
          <compile Pname="CM7" define="STM32H745xx"/>
          <compile Pname="CM4" define="STM32H745xx"/>

          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="208"/>
        </device>

        <!-- *************************  Device 'STM32H745IGKx'  ***************************** -->
        <device Dname="STM32H745IGKx">
          <compile Pname="CM7" define="STM32H745xG"/>
          <compile Pname="CM4" define="STM32H745xG"/>

          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H745IGTx'  ***************************** -->
        <device Dname="STM32H745IGTx">
          <compile Pname="CM7" define="STM32H745xG"/>
          <compile Pname="CM4" define="STM32H745xG"/>

          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H745IIKx'  ***************************** -->
        <device Dname="STM32H745IIKx">
          <compile Pname="CM7" define="STM32H745xx"/>
          <compile Pname="CM4" define="STM32H745xx"/>

          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H745IITx'  ***************************** -->
        <device Dname="STM32H745IITx">
          <compile Pname="CM7" define="STM32H745xx"/>
          <compile Pname="CM4" define="STM32H745xx"/>

