cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H747XGHx'  ***************************** -->
        <device Dname="STM32H747XGHx">
          <compile Pname="CM7" define="STM32H747xG"/>
          <compile Pname="CM4" define="STM32H747xG"/>

          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="BGA" n="240"/>
        </device>

        <!-- *************************  Device 'STM32H747XIHx'  ***************************** -->
        <device Dname="STM32H747XIHx">
          <compile Pname="CM7" define="STM32H747xx"/>
          <compile Pname="CM4" define="STM32H747xx"/>

          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="240"/>
        </device>

        <!-- *************************  Device 'STM32H747ZIYx'  ***************************** -->
        <device Dname="STM32H747ZIYx">
          <compile Pname="CM7" define="STM32H747xx"/>
          <compile Pname="CM4" define="STM32H747xx"/>

          <memory Pname="CM7" name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory Pname="CM4" name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="CSP" n="156"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32H757' Dual Core  ****************** -->
      <subFamily DsubFamily="STM32H757">
        <processor Pname="CM7" Dcore="Cortex-M7" DcoreVersion="r0p1" Dmpu="MPU" Dfpu="DP_FPU" Dendian="Little-endian" Dclock="480000000"/>
        <processor Pname="CM4" Dcore="Cortex-M4" DcoreVersion="r0p1" Dmpu="MPU" Dfpu="SP_FPU" Dendian="Little-endian" Dclock="240000000"/>
        <debug Pname="CM7"  __ap="0" svd="CMSIS/SVD/STM32H757_CM7.svd"/>
        <debug Pname="CM4"  __ap="3" svd="CMSIS/SVD/STM32H757_CM4.svd"/>
        <compile Pname="CM7" header="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h" define="STM32H757xx" Pdefine="CORE_CM7"/>
        <compile Pname="CM4" header="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h" define="STM32H757xx" Pdefine="CORE_CM4"/>

        <book Pname="CM7" name="Documentation/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>
        <book Pname="CM4" name="Documentation/DUI0553B_cortex_m4_dgug.pdf" title="Cortex-M4 Generic User Guide"/>
        <book             name="Documentation/DM00176879.pdf" title="STM32H745/755 and STM32H747/757 Reference Manual"/>
        <book             name="Documentation/DS12931.pdf" title="STM32H757xI Data Sheet"/>

        <description>
          The STM32H757 devices are dual processor devices:
        </description>
        <description Pname="CM7">
          32-bit Arm Cortex-M7 core with doubleprecision FPU and L1 cache: 16 Kbytes of data and 16 Kbytes of instruction cache;
          frequency up to 480 MHz, MPU, 1027 DMIPS/2.14 DMIPS/MHz (Dhrystone 2.1), and DSP instructions.
        </description>
        <description Pname="CM4">
          32-bit Arm 32-bit Cortex-M4 core with FPU, Adaptive real-time accelerator (ART Accelerator) for internal Flash memory and external memories,
          frequency up to 240 MHz, MPU, 300 DMIPS/1.25 DMIPS/MHz (Dhrystone 2.1), and DSP instructions.
        </description>

        <debugvars configfile="CMSIS/Debug/STM32H745_747_755_757.dbgconf" version="1.1.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000007;   // DBGMCU_CR:       DBGMCU configuration register
                                                 //                  [ 8] DBGSTBY_D3, [ 7] DBGSTOP_D3
                                                 //                  [ 5] DBGSTBY_D2, [ 4] DBGSTOP_D2,  [ 3] DBGSLEEP_D2
                                                 //                  [ 2] DBGSTBY_D1, [ 1] DBGSTOP_D1,  [ 0] DBGSLEEP_D1
          __var DbgMCU_APB3_Fz1  = 0x00000000;   // DBGMCU_APB3FZ1:  DBGMCU CPU1 APB3 peripheral freeze register
          __var DbgMCU_APB3_Fz2  = 0x00000000;   // DBGMCU_APB3FZ2:  DBGMCU CPU2 APB3 peripheral freeze register
          __var DbgMCU_APB1L_Fz1 = 0x00000000;   // DBGMCU_APB1LFZ1: DBGMCU CPU1 APB1L peripheral freeze register
          __var DbgMCU_APB1L_Fz2 = 0x00000000;   // DBGMCU_APB1LFZ2: DBGMCU CPU2 APB1L peripheral freeze register
          __var DbgMCU_APB2_Fz1  = 0x00000000;   // DBGMCU_APB2FZ1:  DBGMCU CPU1 APB2 peripheral freeze register
          __var DbgMCU_APB2_Fz2  = 0x00000000;   // DBGMCU_APB2FZ2:  DBGMCU CPU2 APB2 peripheral freeze register
          __var DbgMCU_APB4_Fz1  = 0x00000000;   // DBGMCU_APB4FZ1:  DBGMCU CPU1 APB4 peripheral freeze register
          __var DbgMCU_APB4_Fz2  = 0x00000000;   // DBGMCU_APB4FZ2:  DBGMCU CPU2 APB4 peripheral freeze register

          __var TraceClk_Pin     = 0x00040002;   // PE2
          __var TraceD0_Pin      = 0x00040003;   // PE3
          __var TraceD1_Pin      = 0x00040004;   // PE4
          __var TraceD2_Pin      = 0x00040005;   // PE5
          __var TraceD3_Pin      = 0x00040006;   // PE6
        </debugvars>

        <sequences>
          <sequence name="DebugDeviceUnlock">
            <block>
              __var value = 0;

              Sequence("CheckID");

              __ap   = 2;                                         // Switch to System Debug Access Port

              value  = Read32(0xE00E1004);                        // Read DBGMCU_CR
              value |= 0x00670000;                                // set preset values (enable all debug clocks by default)
                                                                  // DBGMCU_CR[18] CKDBGD3EN, [17] CKDBGD2EN, [16] CKDBGD1EN
                                                                  // DBGMCU_CR[22] D3DBGCKEN, [21] D1DBGCKEN
            </block>

