cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
        <!-- *************************  Device 'STM32H7A3QIYxQ'  ***************************** -->
        <device Dname="STM32H7A3QIYxQ">
          <compile define="STM32H7A3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="CSP" n="132"/>
        </device>

        <!-- *************************  Device 'STM32H7A3LIHxQ'  ***************************** -->
        <device Dname="STM32H7A3LIHxQ">
          <compile define="STM32H7A3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="225"/>
        </device>

        <!-- *************************  Device 'STM32H7A3AIIxQ'  ***************************** -->
        <device Dname="STM32H7A3AIIxQ">
          <compile define="STM32H7A3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="169"/>
        </device>

        <!-- ################################### 1MB ################################## -->
        <!-- *************************  Device 'STM32H7A3ZGTx'  ***************************** -->
        <device Dname="STM32H7A3ZGTx">
          <compile define="STM32H7A3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H7A3ZGTxQ'  ***************************** -->
        <device Dname="STM32H7A3ZGTxQ">
          <compile define="STM32H7A3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H7A3NGHx'  ***************************** -->
        <device Dname="STM32H7A3NGHx">
          <compile define="STM32H7A3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="BGA" n="216"/>
        </device>

        <!-- *************************  Device 'STM32H7A3VGHx'  ***************************** -->
        <device Dname="STM32H7A3VGHx">
          <compile define="STM32H7A3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7A3VGHxQ'  ***************************** -->
        <device Dname="STM32H7A3VGHxQ">
          <compile define="STM32H7A3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7A3VGTx'  ***************************** -->
        <device Dname="STM32H7A3VGTx">
          <compile define="STM32H7A3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7A3VGTxQ'  ***************************** -->
        <device Dname="STM32H7A3VGTxQ">
          <compile define="STM32H7A3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7A3RGTx'  ***************************** -->
        <device Dname="STM32H7A3RGTx">
          <compile define="STM32H7A3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32H7A3LGHxQ'  ***************************** -->
        <device Dname="STM32H7A3LGHxQ">
          <compile define="STM32H7A3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="BGA" n="225"/>
        </device>

        <!-- *************************  Device 'STM32H7A3IGKx'  ***************************** -->
        <device Dname="STM32H7A3IGKx">
          <compile define="STM32H7A3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00080000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H7A3IGKxQ'  ***************************** -->
        <device Dname="STM32H7A3IGKxQ">
          <compile define="STM32H7A3xxQ"/>

