cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
        <!-- *************************  Device 'STM32H7B3IITx'  ***************************** -->
        <device Dname="STM32H7B3IITx">
          <compile define="STM32H7B3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H7B3IITxQ'  ***************************** -->
        <device Dname="STM32H7B3IITxQ">
          <compile define="STM32H7B3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H7B3NIHx'  ***************************** -->
        <device Dname="STM32H7B3NIHx">
          <compile define="STM32H7B3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="216"/>
        </device>

        <!-- *************************  Device 'STM32H7B3RITx'  ***************************** -->
        <device Dname="STM32H7B3RITx">
          <compile define="STM32H7B3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32H7B3VITx'  ***************************** -->
        <device Dname="STM32H7B3VITx">
          <compile define="STM32H7B3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7B3VITxQ'  ***************************** -->
        <device Dname="STM32H7B3VITxQ">
          <compile define="STM32H7B3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7B3VIHx'  ***************************** -->
        <device Dname="STM32H7B3VIHx">
          <compile define="STM32H7B3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7B3VIHxQ'  ***************************** -->
        <device Dname="STM32H7B3VIHxQ">
          <compile define="STM32H7B3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H7B3ZITx'  ***************************** -->
        <device Dname="STM32H7B3ZITx">
          <compile define="STM32H7B3xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H7B3ZITxQ'  ***************************** -->
        <device Dname="STM32H7B3ZITxQ">
          <compile define="STM32H7B3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H7B3QIYxQ'  ***************************** -->
        <device Dname="STM32H7B3QIYxQ">
          <compile define="STM32H7B3xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>
          <memory name="FLASH_Bank2" access="rx" start="0x08100000" size="0x00100000" default="1" startup="1"/>

          <feature type="CSP" n="132"/>
        </device>

      </subFamily>

      <!-- ************************  Subfamily 'STM32H7B0'  **************************** -->
      <subFamily DsubFamily="STM32H7B0">
        <processor Dcore="Cortex-M7" DcoreVersion="r0p1" Dmpu="MPU" Dfpu="DP_FPU" Dendian="Little-endian" Dclock="280000000"/>
        <debug svd="CMSIS/SVD/STM32H7B0.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h"/>

        <book name="Documentation/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>
        <book name="Documentation/DM00463927.pdf" title="STM32H7A3/B3 and STM32H7B0 Value line Reference Manual"/>
        <book name="Documentation/DS13196.pdf" title="STM32H7B0xB Data Sheet"/>

        <debugvars configfile="CMSIS/Debug/STM32H7A3_7B3_7B0.dbgconf" version="1.1.0">
          // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
          __var DbgMCU_CR        = 0x00000007;   // DBGMCU_CR:       DBGMCU configuration register
                                                 //                  [ 8] DBGSTBY_D3, [ 7] DBGSTOP_D3
                                                 //                  [ 2] DBGSTBY_D1, [ 1] DBGSTOP_D1,  [ 0] DBGSLEEP_D1
          __var DbgMCU_APB3_Fz1  = 0x00000000;   // DBGMCU_APB3FZ1:  DBGMCU APB3 peripheral freeze register
          __var DbgMCU_APB1L_Fz1 = 0x00000000;   // DBGMCU_APB1LFZ1: DBGMCU APB1L peripheral freeze register
          __var DbgMCU_APB2_Fz1  = 0x00000000;   // DBGMCU_APB2FZ1:  DBGMCU APB2 peripheral freeze register
          __var DbgMCU_APB4_Fz1  = 0x00000000;   // DBGMCU_APB4FZ1:  DBGMCU APB4 peripheral freeze register

          __var TraceClk_Pin     = 0x00040002;   // PE2
          __var TraceD0_Pin      = 0x00040003;   // PE3
          __var TraceD1_Pin      = 0x00040004;   // PE4
          __var TraceD2_Pin      = 0x00040005;   // PE5
          __var TraceD3_Pin      = 0x00040006;   // PE6
        </debugvars>

