cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
        <sequences>
          <sequence name="DebugDeviceUnlock">
            <block>
              __var value = 0;

              Sequence("CheckID");

              __ap   = 2;                                         // Switch to System Debug Access Port

              value  = Read32(0xE00E1004);                        // Read DBGMCU_CR
              value |= 0x00670000;                                // set preset values (enable all debug clocks by default)
                                                                  // DBGMCU_CR[18] CKDBGD3EN, [17] CKDBGD2EN, [16] CKDBGD1EN
                                                                  // DBGMCU_CR[22] D3DBGCKEN, [21] D1DBGCKEN
            </block>

            <control if="__traceout"> <!-- Enable Trace Clock and hence access to global trace components now -->
              <block>
                value |= 0x00100000;                              // DBGMCU_CR[20] TRACECLKEN
              </block>
            </control>

            <block>
              Write32(0xE00E1004, value);                         // Update DBGMCU_CR
            </block>

            <block info="DbgMCU registers">
              Write32(0xE00E1004 , DbgMCU_CR        | value);     // DBGMCU_CR:       Configure MCU Debug
              Write32(0xE00E1034 , DbgMCU_APB3_Fz1         );     // DBGMCU_APB3FZ1:  Configure APB3 peripheral freeze behavior
              Write32(0xE00E103C , DbgMCU_APB1L_Fz1        );     // DBGMCU_APB1LFZ1: Configure APB1L peripheral freeze behavior
              Write32(0xE00E1044 , DbgMCU_APB1H_Fz1        );     // DBGMCU_APB1HFZ1: Configure APB1H peripheral freeze behavior
              Write32(0xE00E104C , DbgMCU_APB2_Fz1         );     // DBGMCU_APB2FZ1:  Configure APB2 peripheral freeze behavior
              Write32(0xE00E1054 , DbgMCU_APB4_Fz1         );     // DBGMCU_APB4FZ1:  Configure APB4 peripheral freeze behavior
            </block>
          </sequence>

        </sequences>

        <algorithm name="CMSIS/Flash/STM32H72x-73x_1024.FLM" start="0x08000000" size="0x00100000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>

        <memory    name="DTCMRAM"     access="rwx"           start="0x20000000" size="0x00020000" default="1" init="0"/>
        <memory    name="RAM_D1"      access="rwx"           start="0x24000000" size="0x00050000" default="1" init="0"/>
        <memory    name="RAM_D2"      access="rwx"           start="0x30000000" size="0x00008000" default="1" init="0"/>
        <memory    name="RAM_D3"      access="rwx"           start="0x38000000" size="0x00004000" default="1" init="0"/>

        <!-- **********************************  1MB ***************************** -->
        <!-- *************************  Device 'STM32H725VGHx'  ***************************** -->
        <device Dname="STM32H725VGHx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H725IGKx'  ***************************** -->
        <device Dname="STM32H725IGKx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H725IGTx'  ***************************** -->
        <device Dname="STM32H725IGTx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H725AGIx'  ***************************** -->
        <device Dname="STM32H725AGIx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="BGA" n="169"/>
        </device>

        <!-- *************************  Device 'STM32H725RGVx'  ***************************** -->
        <device Dname="STM32H725RGVx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="68"/>
        </device>

        <!-- *************************  Device 'STM32H725ZGTx'  ***************************** -->
        <device Dname="STM32H725ZGTx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H725VGTx'  ***************************** -->
        <device Dname="STM32H725VGTx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H725VGYx'  ***************************** -->
        <device Dname="STM32H725VGYx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00100000" default="1" startup="1"/>

          <feature type="CSP" n="100"/>
        </device>

        <!-- **********************************  512KB ***************************** -->
        <!-- *************************  Device 'STM32H725REVx'  ***************************** -->
        <device Dname="STM32H725REVx">
          <compile define="STM32H725xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00080000" default="1" startup="1"/>

          <feature type="QFP" n="68"/>
        </device>

        <!-- *************************  Device 'STM32H725VETx'  ***************************** -->
        <device Dname="STM32H725VETx">
          <compile define="STM32H725xx"/>

