cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
            <control if="__traceout"> <!-- Enable Trace Clock and hence access to global trace components now -->
              <block>
                value |= 0x00100000;                              // DBGMCU_CR[20] TRACECLKEN
              </block>
            </control>

            <block>
              Write32(0xE00E1004, value);                         // Update DBGMCU_CR
            </block>

            <block info="DbgMCU registers">
              Write32(0xE00E1004 , DbgMCU_CR        | value);     // DBGMCU_CR:       Configure MCU Debug
              Write32(0xE00E1034 , DbgMCU_APB3_Fz1         );     // DBGMCU_APB3FZ1:  Configure APB3 peripheral freeze behavior
              Write32(0xE00E103C , DbgMCU_APB1L_Fz1        );     // DBGMCU_APB1LFZ1: Configure APB1L peripheral freeze behavior
              Write32(0xE00E1044 , DbgMCU_APB1H_Fz1        );     // DBGMCU_APB1HFZ1: Configure APB1H peripheral freeze behavior
              Write32(0xE00E104C , DbgMCU_APB2_Fz1         );     // DBGMCU_APB2FZ1:  Configure APB2 peripheral freeze behavior
              Write32(0xE00E1054 , DbgMCU_APB4_Fz1         );     // DBGMCU_APB4FZ1:  Configure APB4 peripheral freeze behavior
            </block>
          </sequence>

        </sequences>

        <algorithm name="CMSIS/Flash/STM32H730xx_128.FLM" start="0x08000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x8000" default="1"/>

        <memory    name="DTCMRAM"     access="rwx"        start="0x20000000" size="0x00020000" default="1" init="0"/>
        <memory    name="RAM_D1"      access="rwx"        start="0x24000000" size="0x00050000" default="1" init="0"/>
        <memory    name="RAM_D2"      access="rwx"        start="0x30000000" size="0x00008000" default="1" init="0"/>
        <memory    name="RAM_D3"      access="rwx"        start="0x38000000" size="0x00004000" default="1" init="0"/>

        <!-- *************************  Device 'STM32H730VBHx'  ***************************** -->
        <device Dname="STM32H730VBHx">
          <compile define="STM32H730xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00020000" default="1" startup="1"/>

          <feature type="BGA" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H730VBTx'  ***************************** -->
        <device Dname="STM32H730VBTx">
          <compile define="STM32H730xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00020000" default="1" startup="1"/>

          <feature type="QFP" n="100"/>
        </device>

        <!-- *************************  Device 'STM32H730IBTxQ'  ***************************** -->
        <device Dname="STM32H730IBTxQ">
          <compile define="stm32h730xxq"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00020000" default="1" startup="1"/>

          <feature type="QFP" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H730IBKxQ'  ***************************** -->
        <device Dname="STM32H730IBKxQ">
          <compile define="STM32H730xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00020000" default="1" startup="1"/>

          <feature type="BGA" n="176"/>
        </device>

        <!-- *************************  Device 'STM32H730ZBTx'  ***************************** -->
        <device Dname="STM32H730ZBTx">
          <compile define="STM32H730xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00020000" default="1" startup="1"/>

          <feature type="QFP" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H730ZBIx'  ***************************** -->
        <device Dname="STM32H730ZBIx">
          <compile define="STM32H730xx"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00020000" default="1" startup="1"/>

          <feature type="BGA" n="144"/>
        </device>

        <!-- *************************  Device 'STM32H730ABIxQ'  ***************************** -->
        <device Dname="STM32H730ABIxQ">
          <compile define="STM32H730xxQ"/>

          <memory name="FLASH_Bank1" access="rx" start="0x08000000" size="0x00020000" default="1" startup="1"/>

          <feature type="BGA" n="169"/>
        </device>

      </subFamily>

    </family>

  </devices>

  <conditions>
    <!-- Core + Compiler Conditions -->
    <condition id="CM7_LE_ARMCC">
      <description>Cortex-M7 processor based device in little endian mode for the ARM Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7F_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the ARM Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7_LE_GCC">
      <description>Cortex-M7 processor based device in little endian mode for the GCC Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7F_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7F_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32H7">
      <description>STMicroelectronics STM32H7 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7*"/>
    </condition>
    <condition id="STM32H742">
      <description>STMicroelectronics STM32H742 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H742*"/>
    </condition>
