cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
    <condition id="STM32H743">
      <description>STMicroelectronics STM32H743 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H743*"/>
    </condition>
    <condition id="STM32H745xG">
      <description>STMicroelectronics STM32H745xG Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H745?G*"/>
    </condition>
    <condition id="STM32H745">
      <description>STMicroelectronics STM32H745 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H745*"/>
      <deny    Dvendor="STMicroelectronics:13" Dname="STM32H745?G*"/>
    </condition>
    <condition id="STM32H747xG">
      <description>STMicroelectronics STM32H747 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H747?G*"/>
    </condition>
    <condition id="STM32H747">
      <description>STMicroelectronics STM32H747 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H747*"/>
      <deny    Dvendor="STMicroelectronics:13" Dname="STM32H747?G*"/>
    </condition>
    <condition id="STM32H750">
      <description>STMicroelectronics STM32H750 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H750*"/>
    </condition>
    <condition id="STM32H753">
      <description>STMicroelectronics STM32H753 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H753*"/>
    </condition>
    <condition id="STM32H755">
      <description>STMicroelectronics STM32H755 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H755*"/>
    </condition>
    <condition id="STM32H757">
      <description>STMicroelectronics STM32H757 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H757*"/>
    </condition>
    <condition id="STM32H7A3">
      <description>STMicroelectronics STM32H7A3 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7A3*"/>
      <deny    Dvendor="STMicroelectronics:13" Dname="STM32H7A3*Q"/>
    </condition>
    <condition id="STM32H7A3xQ">
      <description>STMicroelectronics STM32H7A3*Q Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7A3*Q"/>
    </condition>
    <condition id="STM32H7B0">
      <description>STMicroelectronics STM32H7B0 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7B0*"/>
      <deny    Dvendor="STMicroelectronics:13" Dname="STM32H7B0*Q"/>
    </condition>
    <condition id="STM32H7B0xQ">
      <description>STMicroelectronics STM32H7B0*Q Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7B0*Q"/>
    </condition>
    <condition id="STM32H7B3">
      <description>STMicroelectronics STM32H7B3 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7B3*"/>
      <deny    Dvendor="STMicroelectronics:13" Dname="STM32H7B3*Q"/>
    </condition>
    <condition id="STM32H7B3xQ">
      <description>STMicroelectronics STM32H7B3*Q Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7B3*Q"/>
    </condition>
    <condition id="STM32H723">
      <description>STMicroelectronics STM32H723 devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H723*"/>
    </condition>
    <condition id="STM32H733">
      <description>STMicroelectronics STM32H733 devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H733*"/>
    </condition>
    <condition id="STM32H725">
      <description>STMicroelectronics STM32H725 devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H725*"/>
    </condition>
    <condition id="STM32H735">
      <description>STMicroelectronics STM32H735 devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H735*"/>
    </condition>
    <condition id="STM32H730">
      <description>STMicroelectronics STM32H730 devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H730*"/>
      <deny    Dvendor="STMicroelectronics:13" Dname="STM32H730*Q"/>
    </condition>
    <condition id="STM32H730xQ">
      <description>STMicroelectronics STM32H730*Q devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H730*Q"/>
    </condition>

    <condition id="STM32H7_SC">
      <description>STMicroelectronics STM32H7 Single Core Series devices</description>
      <accept condition="STM32H742"/>
      <accept condition="STM32H743"/>
      <accept condition="STM32H750"/>
      <accept condition="STM32H753"/>
      <accept condition="STM32H7A3"/>
      <accept condition="STM32H7A3xQ"/>
      <accept condition="STM32H7B0"/>
      <accept condition="STM32H7B0xQ"/>
      <accept condition="STM32H7B3"/>
      <accept condition="STM32H7B3xQ"/>
      <accept condition="STM32H723"/>
      <accept condition="STM32H733"/>
      <accept condition="STM32H725"/>
      <accept condition="STM32H735"/>
      <accept condition="STM32H730"/>
      <accept condition="STM32H730xQ"/>
    </condition>
    <condition id="STM32H7_DC">
      <description>STMicroelectronics STM32H7 Dual Core Series devices</description>
      <accept condition="STM32H745xG"/>
      <accept condition="STM32H745"/>
      <accept condition="STM32H747xG"/>
      <accept condition="STM32H747"/>
      <accept condition="STM32H755"/>
      <accept condition="STM32H757"/>
    </condition>
    <condition id="STM32H7_DC_CM7">
      <require condition="STM32H7_DC"/>
      <require Dcore="Cortex-M7"/>
    </condition>
    <condition id="STM32H7_DC_CM4">
      <require condition="STM32H7_DC"/>
      <require Dcore="Cortex-M4"/>
    </condition>

    <!-- Device + Compiler Conditions -->
    <condition id="STM32H742_ARMCC">
      <description>filter for STM32H742 devices and the ARM compiler</description>
      <require condition="STM32H742"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H743_ARMCC">
      <description>filter for STM32H743 devices and the ARM compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H745xG_ARMCC">
      <description>filter for STM32H745xG devices and the ARM compiler</description>
      <require condition="STM32H745xG"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H745_ARMCC">
      <description>filter for STM32H745 devices and the ARM compiler</description>
      <require condition="STM32H745"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H747xG_ARMCC">
      <description>filter for STM32H747xG devices and the ARM compiler</description>
      <require condition="STM32H747xG"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H747_ARMCC">
      <description>filter for STM32H747 devices and the ARM compiler</description>
      <require condition="STM32H747"/>
      <require Tcompiler="ARMCC"/>
    </condition>
