cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
    <condition id="STM32H750_ARMCC">
      <description>filter for STM32H750 devices and the ARM compiler</description>
      <require condition="STM32H750"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H753_ARMCC">
      <description>filter for STM32H753 devices and the ARM compiler</description>
      <require condition="STM32H753"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H755_ARMCC">
      <description>filter for STM32H755 devices and the ARM compiler</description>
      <require condition="STM32H755"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H757_ARMCC">
      <description>filter for STM32H757 devices and the ARM compiler</description>
      <require condition="STM32H757"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H7A3_ARMCC">
      <description>filter for STM32H7A3 devices and the ARM compiler</description>
      <require condition="STM32H7A3"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H7A3xQ_ARMCC">
      <description>filter for STM32H7A3*Q devices and the ARM compiler</description>
      <require condition="STM32H7A3xQ"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H7B0_ARMCC">
      <description>filter for STM32H7B0 devices and the ARM compiler</description>
      <require condition="STM32H7B0"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H7B0xQ_ARMCC">
      <description>filter for STM32H7B0*Q devices and the ARM compiler</description>
      <require condition="STM32H7B0xQ"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H7B3_ARMCC">
      <description>filter for STM32H7B3 devices and the ARM compiler</description>
      <require condition="STM32H7B3"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H7B3xQ_ARMCC">
      <description>filter for STM32H7B3*Q devices and the ARM compiler</description>
      <require condition="STM32H7B3xQ"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H723_ARMCC">
      <description>filter for STM32H723 devices and the ARM compiler</description>
      <require condition="STM32H723"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H733_ARMCC">
      <description>filter for STM32H733 devices and the ARM compiler</description>
      <require condition="STM32H733"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H725_ARMCC">
      <description>filter for STM32H725 devices and the ARM compiler</description>
      <require condition="STM32H725"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H735_ARMCC">
      <description>filter for STM32H735 devices and the ARM compiler</description>
      <require condition="STM32H735"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H730_ARMCC">
      <description>filter for STM32H730 devices and the ARM compiler</description>
      <require condition="STM32H730"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H730xQ_ARMCC">
      <description>filter for STM32H730*Q devices and the ARM compiler</description>
      <require condition="STM32H730xQ"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32H742_GCC">
      <description>filter for STM32H742 devices and the GCC compiler</description>
      <require condition="STM32H742"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H743_GCC">
      <description>filter for STM32H743 devices and the GCC compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H745xG_GCC">
      <description>filter for STM32H745xG devices and the GCC compiler</description>
      <require condition="STM32H745xG"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H745_GCC">
      <description>filter for STM32H745 devices and the GCC compiler</description>
      <require condition="STM32H745"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H747xG_GCC">
      <description>filter for STM32H747xG devices and the GCC compiler</description>
      <require condition="STM32H747xG"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H747_GCC">
      <description>filter for STM32H747 devices and the GCC compiler</description>
      <require condition="STM32H747"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H750_GCC">
      <description>filter for STM32H750 devices and the GCC compiler</description>
      <require condition="STM32H750"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H753_GCC">
      <description>filter for STM32H753 devices and the GCC compiler</description>
      <require condition="STM32H753"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H755_GCC">
      <description>filter for STM32H755 devices and the GCC compiler</description>
      <require condition="STM32H755"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H757_GCC">
      <description>filter for STM32H757 devices and the GCC compiler</description>
      <require condition="STM32H757"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H7A3_GCC">
      <description>filter for STM32H7A3 devices and the GCC compiler</description>
      <require condition="STM32H7A3"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H7A3xQ_GCC">
      <description>filter for STM32H7A3*Q devices and the GCC compiler</description>
      <require condition="STM32H7A3xQ"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H7B0_GCC">
      <description>filter for STM32H7B0 devices and the GCC compiler</description>
      <require condition="STM32H7B0"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H7B0xQ_GCC">
      <description>filter for STM32H7B0*Q devices and the GCC compiler</description>
      <require condition="STM32H7B0xQ"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H7B3_GCC">
      <description>filter for STM32H7B3 devices and the GCC compiler</description>
      <require condition="STM32H7B3"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H7B3xQ_GCC">
      <description>filter for STM32H7B3*Q devices and the GCC compiler</description>
      <require condition="STM32H7B3xQ"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H723_GCC">
      <description>filter for STM32H723 devices and the GCC compiler</description>
      <require condition="STM32H723"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H733_GCC">
      <description>filter for STM32H733 devices and the GCC compiler</description>
      <require condition="STM32H733"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H725_GCC">
      <description>filter for STM32H725 devices and the GCC compiler</description>
      <require condition="STM32H725"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H735_GCC">
      <description>filter for STM32H735 devices and the GCC compiler</description>
      <require condition="STM32H735"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H730_GCC">
      <description>filter for STM32H730 devices and the GCC compiler</description>
      <require condition="STM32H730"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H730xQ_GCC">
      <description>filter for STM32H730*Q devices and the GCC compiler</description>
      <require condition="STM32H730xQ"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="STM32H742_IAR">
      <description>filter for STM32H742 devices and the IAR compiler</description>
      <require condition="STM32H742"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H743_IAR">
      <description>filter for STM32H743 devices and the IAR compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H745xG_IAR">
      <description>filter for STM32H745xG devices and the IAR compiler</description>
      <require condition="STM32H745xG"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H745_IAR">
      <description>filter for STM32H745 devices and the IAR compiler</description>
      <require condition="STM32H745"/>
      <require Tcompiler="IAR"/>
    </condition>
