cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
    <condition id="STM32H743I-EVAL BSP NOR">
      <description>STMicroelectronics STM32H743I-EVAL BSP NOR</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP QSPI">
      <description>STMicroelectronics STM32H743I-EVAL BSP QSPI</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP SD">
      <description>STMicroelectronics STM32H743I-EVAL BSP SD</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP SDRAM">
      <description>STMicroelectronics STM32H743I-EVAL BSP SDRAM</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SDRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="MDMA"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP SRAM">
      <description>STMicroelectronics STM32H743I-EVAL BSP SRAM</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32H743I-EVAL BSP TS">
      <description>STMicroelectronics STM32H743I-EVAL BSP TS</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="BUS"/>
    </condition>


    <!-- STM32H7B3I-EVAL Board BSP Conditions -->
    <condition id="STM32H7B3I-EVAL LCD_RGB">
      <description>STMicroelectronics STM32H7B3I-EVAL LCD (RGB IF)</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Graphics Display" Cgroup="STM32H7B3I-EVAL" Cvariant="RGB IF"/>
    </condition>
    <condition id="STM32H7B3I-EVAL GLCD">
      <description>STMicroelectronics STM32H7B3I-EVAL GLCD</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="LCD"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
    </condition>
    <condition id="STM32H7B3I-EVAL LED">
      <description>STMicroelectronics STM32H7B3I-EVAL LED</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32H7B3I-EVAL TS">
      <description>STMicroelectronics STM32H7B3I-EVAL TS</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Touch Screen"/>
    </condition>
    <condition id="STM32H7B3I-EVAL Joystick">
      <description>STMicroelectronics STM32H7B3I-EVAL Joystick</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2C"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="ADC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="UART"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP Audio">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP Audio</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SAI"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="I2S"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="TIM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="BUS"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP BUS">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP BUS</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP Camera">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP Camera</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DCMI"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="BUS"/>
    </condition>
