cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
    <condition id="STM32H7B3I-EVAL BSP EEPROM">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP EEPROM</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="BUS"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP IO">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP IO</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="Basic I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="BUS"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP LCD">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP LCD</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="LTDC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA2D"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="SDRAM"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="BUS"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP NOR">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP NOR</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="NOR"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP OSPI">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP OSPI</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="QSPI"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP SD">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP SD</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SD"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP SDRAM">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP SDRAM</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SDRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="MDMA"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP SRAM">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP SRAM</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="SRAM"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
    <condition id="STM32H7B3I-EVAL BSP TS">
      <description>STMicroelectronics STM32H7B3I-EVAL BSP TS</description>
      <require condition="STM32H7"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="I/O"/>
      <require Cclass="Board Support" Cgroup="Drivers" Csub="BUS"/>
    </condition>

  </conditions>

  <generators>
    <generator id="STM32CubeMX">
      <gpdsc name="$PSTM32CubeMX/FrameworkCubeMX.gpdsc"/>        <!-- path is either absolute or relative to working directory -->
      <workingDir>$PSTM32CubeMX</workingDir>                     <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <exe>
        <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command>
        <argument>$D</argument>                                  <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>#P</argument>                                  <!-- Project path and project name (as configured by environment) -->
        <argument>$SMDK/CubeMX/SC</argument>                     <!-- absolute or relative to ftl templates. $S = Device Family Pack base folder -->
      </exe>
    </generator>
    <generator id="STM32CubeMX_CM7">
      <gpdsc name="$PSTM32CubeMX/FrameworkCubeMX.gpdsc"/>        <!-- path is either absolute or relative to working directory -->
      <workingDir>$P../STM32CubeMX</workingDir>                  <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <exe>
        <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command>
        <argument>$D</argument>                                  <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>#P</argument>                                  <!-- Project path and project name (as configured by environment) -->
        <argument>$SMDK/CubeMX/DC</argument>                     <!-- absolute or relative to ftl templates. $S = Device Family Pack base folder -->
      </exe>
    </generator>
    <generator id="STM32CubeMX_CM4">
      <gpdsc name="$PSTM32CubeMX/FrameworkCubeMX.gpdsc"/>        <!-- path is either absolute or relative to working directory -->
      <workingDir>$P../STM32CubeMX</workingDir>                  <!-- path is specified either absolute or relative to PDSC or GPDSC file -->
      <exe>
        <command>MDK/CubeMX/STM32CubeMxLauncher.exe</command>
        <argument>$D</argument>                                  <!-- D = Device (Dname/Dvariant as configured by environment) -->
        <argument>#P</argument>                                  <!-- Project path and project name (as configured by environment) -->
        <argument>$SMDK/CubeMX/DC</argument>                     <!-- absolute or relative to ftl templates. $S = Device Family Pack base folder -->
      </exe>
    </generator>
  </generators>

  <taxonomy>
    <!--description Cclass="Device" Cgroup="STM32Cube HAL" doc="Documentation/DM00189702.pdf">STM32H7xx Hardware Abstraction Layer (HAL) Drivers</description-->
    <!--description Cclass="Graphics Display">Display Interface including configuration for emWIN</description-->
    <description Cclass="Board Support" Cgroup="Drivers">ST BSP Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="STM32Cube Framework" exclusive="1" Capiversion="1.1.0" condition="STM32H7">
      <description>STM32Cube Framework</description>
      <files>
        <file category="doc" name="MDK/CubeMX/Documentation/index.html"/>
      </files>
    </api>
  </apis>

