cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.11.0" condition="STM32H7 CMSIS">
      <description>System Startup for STMicroelectronics STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STARTUP_STM32H7XX    /* Device Startup for STM32H7 */
      </RTE_Components_h>
      <files>
        <!--  include folder -->
        <file category="include" name="Drivers/CMSIS/Device/ST/STM32H7xx/Include/"/>

        <!-- Flash Option Bytes templates -->
        <!--file category="source" condition="STM32H7_ARMCC" name="MDK/Device/Source/ARM/STM32H7xx_OPT.s" attr="template" select="Flash Option Bytes"/-->
        <!--file category="source" condition="STM32H7_ARMCC" name="MDK/Device/Source/ARM/STM32H7xx_OTP.s" attr="template" select="Flash One-Time programmable Bytes"/-->

        <!-- common device header file -->
        <file category="header"  name="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h"/>

        <!-- startup files -->
        <!-- ARM Compiler Toolchain -->
        <file category="source" condition="STM32H742_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h742xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H743_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h743xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H745xG_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h745xg.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H745_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h745xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H747xG_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h747xg.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H747_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h747xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H750_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h750xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H753_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h753xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H755_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h755xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H757_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h757xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7A3_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h7a3xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7A3xQ_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h7a3xxq.s" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B0_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h7b0xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B0xQ_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h7b0xxq.s" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B3_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h7b3xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B3xQ_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h7b3xxq.s" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H723_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h723xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H725_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h725xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H730_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h730xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H730xQ_ARMCC" name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h730xxq.s" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H733_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h733xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H735_ARMCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/arm/startup_stm32h735xx.s"  attr="config" version="1.11.0"/>

        <!-- GCC Toolchain -->
        <file category="source" condition="STM32H742_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h742xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H743_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h743xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H745xG_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h745xg.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H745_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h745xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H747xG_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h747xg.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H747_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h747xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H750_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h750xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H753_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h753xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H755_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h755xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H757_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h757xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7A3_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h7a3xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7A3xQ_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h7a3xxq.S" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B0_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h7b0xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B0xQ_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h7b0xxq.S" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B3_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h7b3xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B3xQ_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h7b3xxq.S" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H723_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h723xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H725_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h725xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H730_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h730xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H730xQ_GCC"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h730xxq.S" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H733_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h733xx.S"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H735_GCC"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/gcc/startup_stm32h735xx.S"  attr="config" version="1.11.0"/>

        <!-- IAR Toolchain -->
        <file category="source" condition="STM32H742_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h742xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H743_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h743xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H745xG_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h745xg.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H745_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h745xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H747xG_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h747xg.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H747_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h747xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H750_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h750xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H753_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h753xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H755_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h755xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H757_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h757xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7A3_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h7a3xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7A3xQ_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h7a3xxq.s" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B0_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h7b0xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B0xQ_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h7b0xxq.s" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B3_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h7b3xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H7B3xQ_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h7b3xxq.s" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H723_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h723xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H725_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h725xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H730_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h730xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H730xQ_IAR"   name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h730xxq.s" attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H733_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h733xx.s"  attr="config" version="1.11.0"/>
        <file category="source" condition="STM32H735_IAR"     name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/iar/startup_stm32h735xx.s"  attr="config" version="1.11.0"/>

        <!-- system file -->
        <file category="source"                               name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/system_stm32h7xx.c"                       attr="config" version="1.11.0" condition="STM32H7_SC"/>
        <file category="source"                               name="Drivers/CMSIS/Device/ST/STM32H7xx/Source/Templates/system_stm32h7xx_dualcore_boot_cm4_cm7.c" attr="config" version="1.11.0" condition="STM32H7_DC"/>
      </files>
    </component>

    <component generator="STM32CubeMX" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="2.0.0" Capiversion="1.0.0" condition="STM32H7_SC">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/SC/STM32CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/SC/STM32CubeMX/MX_Device_h.ftl" version ="1.0.2"/>
      </files>
    </component>
    <component generator="STM32CubeMX_CM7" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="2.0.0" Capiversion="1.0.0" condition="STM32H7_DC_CM7">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/DC/CM7/STM32CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/DC/CM7/STM32CubeMX/MX_Device_h.ftl" version ="1.0.2"/>
      </files>
    </component>
    <component generator="STM32CubeMX_CM4" Cclass="Device" Cgroup="STM32Cube Framework" Csub="STM32CubeMX" Cversion="2.0.0" Capiversion="1.0.0" condition="STM32H7_DC_CM4">
      <description>Configuration via STM32CubeMX</description>
      <RTE_Components_h>
        #define RTE_DEVICE_FRAMEWORK_CUBE_MX
      </RTE_Components_h>
      <files>
        <file category="doc"     name="MDK/CubeMX/Documentation/cubemx.html"/>
        <file category="source"  name="MDK/CubeMX/run_STM32CubeMX.c" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/DC/CM4/STM32CubeMX/FrameworkCubeMX_gpdsc.ftl" version="1.0.0"/>
        <file category="other"   name="MDK/CubeMX/DC/CM4/STM32CubeMX/MX_Device_h.ftl" version ="1.0.2"/>
      </files>
    </component>

