cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="RNG"        Cversion="1.11.0" condition="STM32H7 LL">
      <description>Random number generator (RNG) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_RNG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_rng.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="RTC"        Cversion="1.11.0" condition="STM32H7 LL">
      <description>Real-time clock (RTC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_RTC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_rtc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SDMMC"      Cversion="1.11.0" condition="STM32H7 LL">
      <description>SD/SDIO/MMC card host interface (SDMMC) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SDMMC
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_sdmmc.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SPI"        Cversion="1.11.0" condition="STM32H7 LL">
      <description>Serial peripheral interface (SPI) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SPI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_spi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="SWPMI"      Cversion="1.11.0" condition="STM32H7 LL">
      <description>Single Wire Protocol Master Interface (SWPMI) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_SWPMI
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_swpmi.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="TIM"        Cversion="1.11.0" condition="STM32H7 LL">
      <description>Timers (TIM) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_TIM
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_tim.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="USART"      Cversion="1.11.0" condition="STM32H7 LL">
      <description>Universal synchronous asynchronous receiver transmitter (USART) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_USART
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_usart.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="USB"        Cversion="1.11.0" condition="STM32H7 LL">
      <description>Universal serial bus full-speed device interface (USB) LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_USB
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_usb.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="STM32Cube LL" Csub="UTILS"      Cversion="1.11.0" condition="STM32H7">
      <description>UTILS LL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_LL_UTILS
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_ll_utils.c"/>
      </files>
    </component>
    <!-- END: STMicroelectronics STM32CubeH7 LL -->

    <!-- CMSIS drivers -->
    <component Cclass="CMSIS Driver" Cgroup="CAN"          Capiversion="1.0.0" Cversion="1.4.0" condition="STM32H7 CMSIS_Driver CAN">
      <description>CAN Driver for STM32H7 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
        #define RTE_Drivers_CAN2                /* Driver CAN2 */
      </RTE_Components_h>
      <files>
        <file category="doc"    name="MDK/CubeMX/Documentation/stm32h7_can.html"/>
        <file category="source" name="CMSIS/Driver/FDCAN_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1.0" Cversion="1.6.0" condition="STM32H7 CMSIS_Driver ETH">
      <description>Ethernet MAC Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="doc"    name="MDK/CubeMX/Documentation/stm32h7_emac.html"/>
        <file category="source" name="CMSIS/Driver/EMAC_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C"          Capiversion="2.2.0" Cversion="1.6.0" condition="STM32H7 CMSIS_Driver I2C">
      <description>I2C Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
        #define RTE_Drivers_I2C4                /* Driver I2C4 */
        #define RTE_Drivers_I2C5                /* Driver I2C5 */
      </RTE_Components_h>
      <files>
        <file category="doc"    name="MDK/CubeMX/Documentation/stm32h7_i2c.html"/>
        <file category="source" name="CMSIS/Driver/I2C_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI"          Capiversion="2.2.0" Cversion="1.8.0" condition="STM32H7 CMSIS_Driver MCI">
      <description>MCI Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
        #define RTE_Drivers_MCI1                /* Driver MCI1 */
      </RTE_Components_h>
      <files>
        <file category="doc"    name="MDK/CubeMX/Documentation/stm32h7_mci.html"/>
        <file category="source" name="CMSIS/Driver/MCI_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI"          Capiversion="2.1.0" Cversion="1.6.0" condition="STM32H7 CMSIS_Driver SPI">
      <description>SPI Driver for STM32H7 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
        #define RTE_Drivers_SPI4                /* Driver SPI4 */
        #define RTE_Drivers_SPI5                /* Driver SPI5 */
        #define RTE_Drivers_SPI6                /* Driver SPI6 */
      </RTE_Components_h>
      <files>
        <file category="doc"    name="MDK/CubeMX/Documentation/stm32h7_spi.html"/>
        <file category="source" name="CMSIS/Driver/SPI_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART"        Capiversion="2.1.0" Cversion="2.3.0" condition="STM32H7 CMSIS_Driver USART">
      <description>USART Driver for STM32H7 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
        #define RTE_Drivers_USART6              /* Driver USART6 */
        #define RTE_Drivers_USART7              /* Driver USART7 */
        #define RTE_Drivers_USART8              /* Driver USART8 */
        #define RTE_Drivers_USART9              /* Driver USART9 */
        #define RTE_Drivers_USART10             /* Driver USART10 */
        #define RTE_Drivers_USART21             /* Driver USART21 */
      </RTE_Components_h>
      <files>
        <file category="doc"    name="MDK/CubeMX/Documentation/stm32h7_uart.html"/>
        <file category="source" name="CMSIS/Driver/UART_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/USART_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/IrDA_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device"   Capiversion="2.1.0" Cversion="1.6.0" condition="STM32H7 CMSIS_Driver USBD">
      <description>USB Device Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="doc"    name="MDK/CubeMX/Documentation/stm32h7_usbd.html"/>
        <file category="source" name="CMSIS/Driver/OTG_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_STM32H7xx.c"/>
      </files>
    </component>
