cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
    <component Cclass="CMSIS Driver" Cgroup="USB Host"     Capiversion="2.1.0" Cversion="1.3.0" condition="STM32H7 CMSIS_Driver USBH">
      <description>USB Host Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="doc"    name="MDK/CubeMX/Documentation/stm32h7_usbh0.html"/>
        <file category="source" name="CMSIS/Driver/OTG_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS1_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS2_STM32H7xx.c"/>
      </files>
    </component>

    <!-- STM32H743I-EVAL Board -->
    <bundle Cbundle="STM32H743I-EVAL" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32H743I-EVAL Board</description>
      <doc>Drivers/BSP/STM32H743I-EVAL/STM32H743I-EVAL_BSP_User_Manual.chm</doc>
      <component Cgroup="Drivers" Csub="Basic I/O"                            condition="STM32H743I-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H743I_EVAL/ConfigTemplate/stm32h743i_eval_conf.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"                                condition="STM32H743I-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994.c"/>
          <file category="source" name="Drivers/BSP/Components/wm8994/wm8994_reg.c"/>
          <file category="library" condition="CM7_LE_ARMCC"  name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_Keil_wc16.lib"/>
          <file category="library" condition="CM7F_LE_ARMCC" name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_Keil_wc16.lib"/>
          <file category="library" condition="CM7_LE_GCC"    name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_GCC_wc32.a"/>
          <file category="library" condition="CM7F_LE_GCC"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_GCC_wc32.a"/>
          <file category="library" condition="CM7_LE_IAR"    name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_IAR_wc32.a"/>
          <file category="library" condition="CM7F_LE_IAR"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_IAR_wc32.a"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="BUS"                                  condition="STM32H743I-EVAL BSP BUS">
        <description>BUS for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_bus.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_bus.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM"                               condition="STM32H743I-EVAL BSP EEPROM">
        <description>EERPOM for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"                                  condition="STM32H743I-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152_reg.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD"                                  condition="STM32H743I-EVAL BSP LCD">
        <description>LCD for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_lcd.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811_reg.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H743I_EVAL/ConfigTemplate/stmpe811_conf.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR"                                  condition="STM32H743I-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_nor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="QSPI"                                 condition="STM32H743I-EVAL BSP QSPI">
        <description>QSPI Flash for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_qspi.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_qspi.c"/>
        </files>
      </component>
