cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
      <component Cgroup="Drivers" Csub="SD"                                   condition="STM32H743I-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SDRAM"                                condition="STM32H743I-EVAL BSP SDRAM">
        <description>SDRAM for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_sdram.c"/>
          <file category="source" name="Drivers/BSP/Components/is42s32800g/is42s32800g.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H743I_EVAL/ConfigTemplate/is42s32800g_conf.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM"                                 condition="STM32H743I-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen"                         condition="STM32H743I-EVAL BSP TS">
        <description>Touch Screen for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32H743I-EVAL/stm32h743i_eval_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811.c"/>
          <file category="source" name="Drivers/BSP/Components/stmpe811/stmpe811_reg.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H743I_EVAL/ConfigTemplate/stmpe811_conf.h" attr="config" version="1.0.0"/>
          <file category="source" name="Drivers/BSP/Components/ts3510/ts3510.c"/>
          <file category="source" name="Drivers/BSP/Components/ts3510/ts3510_reg.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H743I_EVAL/ConfigTemplate/ts3510_conf.h" attr="config" version="1.0.0"/>
          <file category="source" name="Drivers/BSP/Components/exc7200/exc7200.c"/>
          <file category="source" name="Drivers/BSP/Components/exc7200/exc7200_reg.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H743I_EVAL/ConfigTemplate/exc7200_conf.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="LED"           Capiversion="1.0.0"                   condition="STM32H743I-EVAL LED">
        <description>LED Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/LED_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0"                   condition="STM32H7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/Buttons_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0"                   condition="STM32H7 HAL GPIO ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/ADC_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick"      Capiversion="1.0.0"                   condition="STM32H743I-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/Joystick_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen"   Capiversion="1.0.0"                   condition="STM32H743I-EVAL TS">
        <description>Touchscreen Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/Touch_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD"   Capiversion="1.0.0"                   condition="STM32H743I-EVAL GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32H743I_EVAL/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/GLCD_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD"     Capiversion="1.1.0" Cvariant="RGB IF" condition="STM32H743I-EVAL LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/LCD_X.c"/>
        </files>
      </component>
<!--
      <component Cgroup="Audio"         Capiversion="1.1.0" condition="STM32H7 CMSIS SAI and I2C Driver">
        <description>Audio interface for WM8994</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/Audio_743I_EVAL.c"/>
        </files>
      </component>
-->
    </bundle>

    <!-- STM32H7B3I-EVAL Board -->
    <bundle Cbundle="STM32H7B3I-EVAL" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32H7B3I-EVAL Board</description>
      <doc>Drivers/BSP/STM32H7B3I-EVAL/STM32H7B3I-EVAL_BSP_User_Manual.chm</doc>
      <component Cgroup="Drivers" Csub="Basic I/O"                            condition="STM32H7B3I-EVAL BSP">
        <description>LEDs, push-buttons and COM ports for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H7B3I_EVAL/ConfigTemplate/stm32h7b3i_eval_conf.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Audio"                                condition="STM32H7B3I-EVAL BSP Audio">
        <description>Audio for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_audio.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_audio.c"/>
          <file category="source" name="Drivers/BSP/Components/cs42l51/cs42l51.c"/>
          <file category="source" name="Drivers/BSP/Components/cs42l51/cs42l51_reg.c"/>
          <file category="library" condition="CM7_LE_ARMCC"  name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_Keil_wc16.lib"/>
          <file category="library" condition="CM7F_LE_ARMCC" name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_Keil_wc16.lib"/>
          <file category="library" condition="CM7_LE_GCC"    name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_GCC_wc32.a"/>
          <file category="library" condition="CM7F_LE_GCC"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_GCC_wc32.a"/>
          <file category="library" condition="CM7_LE_IAR"    name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_IAR_wc32.a"/>
          <file category="library" condition="CM7F_LE_IAR"   name="Middlewares/ST/STM32_Audio/Addons/PDM/Lib/libPDMFilter_CM7_IAR_wc32.a"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="BUS"                                  condition="STM32H7B3I-EVAL BSP BUS">
        <description>BUS for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_bus.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_bus.c"/>
        </files>
      </component>
