cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
      <component Cgroup="Drivers" Csub="Camera"                               condition="STM32H7B3I-EVAL BSP Camera">
        <description>Camera for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_camera.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_camera.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="EEPROM"                               condition="STM32H7B3I-EVAL BSP EEPROM">
        <description>EERPOM for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_eeprom.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_eeprom.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="I/O"                                  condition="STM32H7B3I-EVAL BSP IO">
        <description>I/O for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_io.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_io.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152.c"/>
          <file category="source" name="Drivers/BSP/Components/mfxstm32l152/mfxstm32l152_reg.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="LCD"                                  condition="STM32H7B3I-EVAL BSP LCD">
        <description>LCD for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_lcd.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_lcd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="NOR"                                  condition="STM32H7B3I-EVAL BSP NOR">
        <description>NOR Flash for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_nor.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_nor.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="OSPI"                                 condition="STM32H7B3I-EVAL BSP OSPI">
        <description>OSPI Flash for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_ospi.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_ospi.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SD"                                   condition="STM32H7B3I-EVAL BSP SD">
        <description>uSD for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_sd.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_sd.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SDRAM"                                condition="STM32H7B3I-EVAL BSP SDRAM">
        <description>SDRAM for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_sdram.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_sdram.c"/>
          <file category="source" name="Drivers/BSP/Components/is42s32800j/is42s32800j.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H7B3I_EVAL/ConfigTemplate/is42s32800j_conf.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="SRAM"                                 condition="STM32H7B3I-EVAL BSP SRAM">
        <description>SRAM for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_sram.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_sram.c"/>
        </files>
      </component>
      <component Cgroup="Drivers" Csub="Touch Screen"                         condition="STM32H7B3I-EVAL BSP TS">
        <description>Touch Screen for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="header" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_ts.h"/>
          <file category="source" name="Drivers/BSP/STM32H7B3I-EVAL/stm32h7b3i_eval_ts.c"/>
          <file category="source" name="Drivers/BSP/Components/ft5336/ft5336.c"/>
          <file category="source" name="Drivers/BSP/Components/ft5336/ft5336_reg.c"/>
          <file category="header" name="MDK/Boards/ST/STM32H7B3I_EVAL/ConfigTemplate/ft5336_conf.h" attr="config" version="1.0.0"/>
        </files>
      </component>
      <component Cgroup="LED"           Capiversion="1.0.0"                   condition="STM32H7B3I-EVAL LED">
        <description>LED Interface for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H7B3I_EVAL/Common/LED_7B3I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0"                   condition="STM32H7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H7B3I_EVAL/Common/Buttons_7B3I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0"                   condition="STM32H7 HAL GPIO ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32H7B3I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H7B3I_EVAL/Common/ADC_7B3I_EVAL.c"/>
        </files>
      </component>
