cmjang/CtrBoard-H7_IMU_Altitude/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/Keil.STM32H7xx_DFP.pdsc
    <example name="emWin GUI Demo" doc="Abstract.txt" folder="MDK/Boards/ST/STM32H743I_EVAL/emWin/GUIDemo">
      <description>emWin Graphics Demo example</description>
      <board name="STM32H743I-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="GUIDemo.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="Graphics" Cgroup="CORE"/>
        <category>Middleware</category>
        <category>Graphics</category>
        <keyword>emWin</keyword>
      </attributes>
    </example>


    <!-- STM32H747I-EVAL Board -->
    <example name="DualCore Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32H747I_EVAL/DualCore" version="1.0.0">
      <description>DualCore Blinky example</description>
      <board name="STM32H747I-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="DualCore.uvmpw"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
      </attributes>
    </example>

    <!-- STM32H7B3I_EVAL Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32H7B3I_EVAL/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32H7B3I-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>
</package>
